lib/performance/test/httperf_output.txt
httperf --timeout=5 --client=0/1 --server=test1-gv --port=4080 --uri=/ReconfiguredHelloWorld --send-buffer=4096 --recv-buffer=16384 --num-conns=60000 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 60000 requests 50000 replies 40000 test-duration 15.525 s

Connection rate: 3864.7 conn/s (0.3 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 0.2 avg 0.3 max 6.8 median 0.5 stddev 0.2
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 3864.8 req/s (0.3 ms/req)
Request size [B]: 83.0

Reply rate [replies/s]: min 3825.9 avg 3867.2 max 3890.7 stddev 35.9 (3 samples)
Reply time (avg) [ms]: first-byte response 0.2 transfer 0.0 => total 0.22

Response duration statistics
                         25%       50%       66%       75%       80%       90%       95%       98%       99%     99.9%    99.99%       Max
First byte (ms) :          1         1         1         1         1         1         1         1         1         2         4         7
Xfer time (ms) :           1         1         1         1         1         1         1         1         1         1         2         5
Total time (ms) :          1         1         1         1         1         1         1         1         1         2         4         7

Reply size [B]: header 182.0 content 13.0 footer 2.0 (total 197.0)
Reply status: 1xx=0 2xx=60000 3xx=3 4xx=4 5xx=5

CPU time [s]: user 2.95 system 12.49 (user 19.0% system 80.4% total 99.5%)
Net I/O: 1049.2 KB/s (8.6*10^6 bps)

Errors: total 30 client-timo 6 socket-timo 7 connrefused 8 connreset 9
Errors: fd-unavail 11 addrunavail 12 ftab-full 13 other 14